In [1]:
import pandas as pd
from pandas import DataFrame, Series
s = Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
b = Series(['Hamza' , 'Ahmed' , "Laiba" , "Fatima" , 'Nasir' , 'Khani'])
b

0     Hamza
1     Ahmed
2     Laiba
3    Fatima
4     Nasir
5     Khani
dtype: object

In [3]:
c = Series(['Shahzad' , 'Ahmed' , "Laiba" , "Fatima" , 'Umer' , 'Khani'])
c

0    Shahzad
1      Ahmed
2      Laiba
3     Fatima
4       Umer
5      Khani
dtype: object

In [4]:
c1 = Series(c.values , index = ['S','A','L','F','A','K'])
c1

S    Shahzad
A      Ahmed
L      Laiba
F     Fatima
A       Umer
K      Khani
dtype: object

In [5]:
c1['A']

A    Ahmed
A     Umer
dtype: object

In [6]:
a = Series(s.values , index = ['a', 'b', 'c' , 'd'])
a

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
d = Series(['ab' , 'cd' , 'ef' , 'gh'], index = a.index)
d

a    ab
b    cd
c    ef
d    gh
dtype: object

In [8]:
dates = pd.date_range('2019-07-01', '2019-07-07')
dates

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-04',
               '2019-07-05', '2019-07-06', '2019-07-07'],
              dtype='datetime64[ns]', freq='D')

In [9]:
b = Series([80, 82, 85, 90,83, 87,90],index = dates)
b

2019-07-01    80
2019-07-02    82
2019-07-03    85
2019-07-04    90
2019-07-05    83
2019-07-06    87
2019-07-07    90
Freq: D, dtype: int64

In [10]:
b.mean()

85.28571428571429

In [11]:
b2 = Series([70, 75, 69, 83, 79, 77,87],index =dates)
b2

2019-07-01    70
2019-07-02    75
2019-07-03    69
2019-07-04    83
2019-07-05    79
2019-07-06    77
2019-07-07    87
Freq: D, dtype: int64

In [12]:
b3 = Series(3, index=dates)
b3

2019-07-01    3
2019-07-02    3
2019-07-03    3
2019-07-04    3
2019-07-05    3
2019-07-06    3
2019-07-07    3
Freq: D, dtype: int64

In [13]:
b2['2019-07-01':'2019-07-05']

2019-07-01    70
2019-07-02    75
2019-07-03    69
2019-07-04    83
2019-07-05    79
Freq: D, dtype: int64

In [14]:
result = DataFrame({'Midterm': [32,76,98,99,67],'Finals':[45,56,76,87,89]},index=[1,2,3,4,5])
result

   Finals  Midterm
1      45       32
2      56       76
3      76       98
4      87       99
5      89       67

In [15]:
result = DataFrame({'Midterm': b ,'Finals':b2},index=[12,23,34,45,56,67,78])
result

    Finals  Midterm
12     NaN      NaN
23     NaN      NaN
34     NaN      NaN
45     NaN      NaN
56     NaN      NaN
67     NaN      NaN
78     NaN      NaN

In [16]:
result = DataFrame({'Midterm': b ,'Finals':b2,})
result

            Finals  Midterm
2019-07-01      70       80
2019-07-02      75       82
2019-07-03      69       85
2019-07-04      83       90
2019-07-05      79       83
2019-07-06      77       87
2019-07-07      87       90

In [17]:
result['differ']=[45,67,87,98,99,99,90]
result

            Finals  Midterm  differ
2019-07-01      70       80      45
2019-07-02      75       82      67
2019-07-03      69       85      87
2019-07-04      83       90      98
2019-07-05      79       83      99
2019-07-06      77       87      99
2019-07-07      87       90      90

In [18]:
diff = result.Midterm - result.Finals
diff

2019-07-01    10
2019-07-02     7
2019-07-03    16
2019-07-04     7
2019-07-05     4
2019-07-06    10
2019-07-07     3
Freq: D, dtype: int64

In [19]:
mult = result.Midterm * result.Finals
mult

2019-07-01    5600
2019-07-02    6150
2019-07-03    5865
2019-07-04    7470
2019-07-05    6557
2019-07-06    6699
2019-07-07    7830
Freq: D, dtype: int64

In [20]:
result['Difference']=diff
result

            Finals  Midterm  differ  Difference
2019-07-01      70       80      45          10
2019-07-02      75       82      67           7
2019-07-03      69       85      87          16
2019-07-04      83       90      98           7
2019-07-05      79       83      99           4
2019-07-06      77       87      99          10
2019-07-07      87       90      90           3

In [21]:
new = DataFrame({'Midterm': b,'Finals': b2 , 'difference': diff , 'Multiply': mult})
new

            Finals  Midterm  Multiply  difference
2019-07-01      70       80      5600          10
2019-07-02      75       82      6150           7
2019-07-03      69       85      5865          16
2019-07-04      83       90      7470           7
2019-07-05      79       83      6557           4
2019-07-06      77       87      6699          10
2019-07-07      87       90      7830           3

In [22]:
new.columns

Index(['Finals', 'Midterm', 'Multiply', 'difference'], dtype='object')

In [23]:
new.difference['2019-07-02':"2019-07-06"]

2019-07-02     7
2019-07-03    16
2019-07-04     7
2019-07-05     4
2019-07-06    10
Freq: D, Name: difference, dtype: int64

In [24]:
new.iloc[6]

Finals          87
Midterm         90
Multiply      7830
difference       3
Name: 2019-07-07 00:00:00, dtype: int64

In [25]:
new.loc['2019-07-03']

Finals          69
Midterm         85
Multiply      5865
difference      16
Name: 2019-07-03 00:00:00, dtype: int64

In [26]:
new.iloc[[1, 3, 5]].difference

2019-07-02     7
2019-07-04     7
2019-07-06    10
Freq: 2D, Name: difference, dtype: int64

In [27]:
new.iloc[[2,4,0]].Midterm

2019-07-03    85
2019-07-05    83
2019-07-01    80
Name: Midterm, dtype: int64

In [28]:
new.Finals[new.Finals>75]

2019-07-04    83
2019-07-05    79
2019-07-06    77
2019-07-07    87
Freq: D, Name: Finals, dtype: int64

In [29]:
new.Midterm[new.Midterm>78]

2019-07-01    80
2019-07-02    82
2019-07-03    85
2019-07-04    90
2019-07-05    83
2019-07-06    87
2019-07-07    90
Freq: D, Name: Midterm, dtype: int64

In [30]:
new.loc['2019-07-04': '2019-07-06']

            Finals  Midterm  Multiply  difference
2019-07-04      83       90      7470           7
2019-07-05      79       83      6557           4
2019-07-06      77       87      6699          10

In [31]:
new.Midterm > 82

2019-07-01    False
2019-07-02    False
2019-07-03     True
2019-07-04     True
2019-07-05     True
2019-07-06     True
2019-07-07     True
Freq: D, Name: Midterm, dtype: bool

In [32]:
new[new.Midterm > 82]

            Finals  Midterm  Multiply  difference
2019-07-03      69       85      5865          16
2019-07-04      83       90      7470           7
2019-07-05      79       83      6557           4
2019-07-06      77       87      6699          10
2019-07-07      87       90      7830           3

In [33]:
obj = pd.Series([4, 7, -5, 3 , 4, 7, 6],index = pd.RangeIndex(start = 0 , stop = 14 , step = 2))
obj.values

array([ 4,  7, -5,  3,  4,  7,  6], dtype=int64)

In [34]:
obj.index

RangeIndex(start=0, stop=14, step=2)

In [35]:
obj1 = pd.Series([4, 7, -5, 6],index = ['a' , 'b' , 'c' ,'a'])
obj1.values

array([ 4,  7, -5,  6], dtype=int64)

In [36]:
obj1['e'] = 34

In [37]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sdata

{'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

In [38]:
states = ['California', 'Ohio', 'Oregon', 'Utah', 'Texas']
states

['California', 'Ohio', 'Oregon', 'Utah', 'Texas']

In [39]:
obj4 = pd.Series(sdata, index=states)
obj4[['Ohio','Texas']]

Ohio     35000.0
Texas    71000.0
dtype: float64

In [43]:
import numpy as np
np.random.seed(1)
pd.Series(np.random.randn(5))

0    1.624345
1   -0.611756
2   -0.528172
3   -1.072969
4    0.865408
dtype: float64

In [41]:
pd.Series(np.linspace(10, 100, 10))

0     10.0
1     20.0
2     30.0
3     40.0
4     50.0
5     60.0
6     70.0
7     80.0
8     90.0
9    100.0
dtype: float64

In [57]:
dict1 = {'a':1 , 'b':2 , 'c':3 , 'd':4}

In [75]:
s = Series(dict1)
#s.index=['q','r','s','t']

s

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
s5 = pd.Series([1, 2, 3,8,87,78,90,23,14], index=[10, 11, 12,13,14,15,16,17,18])
s5.ix[17]

In [ ]:
s5.ix[[17,13,10]]

# Data Frames

In [74]:
result = DataFrame({'Midterm': [32,76,98,99,67],'Finals':[45,56,76,87,89]})
result

   Midterm  Finals
0       32      45
1       76      56
2       98      76
3       99      87
4       67      89

In [76]:
result['Midterm']

0    32
1    76
2    98
3    99
4    67
Name: Midterm, dtype: int64

In [77]:
result["Finals"]

0    45
1    56
2    76
3    87
4    89
Name: Finals, dtype: int64

In [89]:
result[(result.Midterm<70) & (result.Midterm>40)][['Midterm']]

   Midterm
4       67

# Reading CSV file

In [93]:
df  = pd.read_csv('test.csv', parse_dates=['date'])

In [94]:
df

        date         0         1         2
0 2000-01-01  1.103763 -1.909979 -0.808956
1 2000-01-02  1.188917  0.581120  0.861597
2 2000-01-03 -0.964200  0.779764  1.829062
3 2000-01-04  0.782130 -1.720670 -1.108242
4 2000-01-05 -1.867017 -0.528368 -2.488309
5 2000-01-06  2.569280 -0.471901 -0.835033
6 2000-01-07 -0.399323 -0.676427 -0.011256
7 2000-01-08  1.642993  1.013420  1.435667
8 2000-01-09  1.147308  2.138000  0.554171
9 2000-01-10  0.933766  1.387155 -0.560143

In [95]:
df['date']

0   2000-01-01
1   2000-01-02
2   2000-01-03
3   2000-01-04
4   2000-01-05
5   2000-01-06
6   2000-01-07
7   2000-01-08
8   2000-01-09
9   2000-01-10
Name: date, dtype: datetime64[ns]

In [96]:
df.columns

Index(['date', '0', '1', '2'], dtype='object')

In [97]:
df.date

0   2000-01-01
1   2000-01-02
2   2000-01-03
3   2000-01-04
4   2000-01-05
5   2000-01-06
6   2000-01-07
7   2000-01-08
8   2000-01-09
9   2000-01-10
Name: date, dtype: datetime64[ns]

In [99]:
df["newCol"]=df['1']-df['2']

In [100]:
df

        date         0         1         2    newCol
0 2000-01-01  1.103763 -1.909979 -0.808956 -1.101023
1 2000-01-02  1.188917  0.581120  0.861597 -0.280478
2 2000-01-03 -0.964200  0.779764  1.829062 -1.049298
3 2000-01-04  0.782130 -1.720670 -1.108242 -0.612428
4 2000-01-05 -1.867017 -0.528368 -2.488309  1.959941
5 2000-01-06  2.569280 -0.471901 -0.835033  0.363132
6 2000-01-07 -0.399323 -0.676427 -0.011256 -0.665171
7 2000-01-08  1.642993  1.013420  1.435667 -0.422247
8 2000-01-09  1.147308  2.138000  0.554171  1.583828
9 2000-01-10  0.933766  1.387155 -0.560143  1.947298